use [Торговая компания];

begin transaction
		-- Провести оценку количества товара на складе по наименованиям: менее 10 – мало, от 10 до 100 – достаточно, более 100 – избыточно.
		select	g.Наименование,
				g.Описание,
				sum(s.Количество) as Количество,
				case
					when sum(s.Количество) < 50 then N'мало'
					when sum(s.Количество) < 100 then N'достаточно'
					else N'избыточно' end as Оценка
			from Склад as s
			join Товар as g
				on g.ID = s.КодТoвара
			group by g.Наименование, g.Описание;
	go
		-- Вывести наименования товаров, количество которых на складе от 1 до 10.
		select g.Наименование, sum(s.Количество) as Количество
			from Склад as s
			join Товар as g
				on g.ID = s.КодТoвара
 			group by g.Наименование, g.Описание
			having sum(s.Количество) between 1 and 90;
	go
		-- Определить тройку товаров, выручка за которые самая большая.
		select top 3 g.Наименование, sum(s.Количество*s.Цена) as Сумма
			from Склад as s
			join Товар as g
				on g.ID = s.КодТoвара
 			group by g.Наименование, g.Описание
			order by Сумма desc;
	go
		-- Определить суммарную стоимость продаж каждого товара по месяцам.
		select g.Наименование, g.Описание, year(d.Дата) as Год, datename(m, d.Дата) as Месяц, sum(d.Количество) as Количество 
			from Сделка as d
			join Товар as g
				on g.ID = (select КодТoвара from Склад where ID = d.КодНаСкладе)
 			group by year(d.Дата), datename(m, d.Дата), g.Наименование, g.Описание
			order by g.Наименование;
	go
		-- Показать месяца, в которых товар, хранящийся на складе с разными ID, был ниже 300 денежных единиц.
		select g.Наименование, g.Описание, year(d.Дата) as Год, datename(m, d.Дата) as Месяц, sum(d.Количество) as Количество 
			from Сделка as d
			join Товар as g
				on g.ID = (select КодТoвара from Склад where ID = d.КодНаСкладе)
			where g.Наименование = N'Отвёртка' and g.Описание = N'Шлицевая'
 			group by year(d.Дата), datename(m, d.Дата), g.Наименование, g.Описание
			having sum(d.Количество) < 80;
commit transaction;