/*
 * Разработать программу, решающую следующую задачу. Вывести в столбик числа, меньшие заданного натурального числа N,
 * согласно указаниям в таблице 1. Рядом с числом в строке напечатать группу символов «*».
 * Количество символов в группе должно совпадать с выведенным в этой строке числом. Если символов в группе больше 50,
 * то количество выводимых символов определяется по модулю 50. Вывод группы символов оформить как функцию.
 */

#include <iostream>
using namespace std;

int main() {
    int N;

    cout << "N = ";
    cin >> N;



}
